Reports/ОтчетФССП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>ОтчетФССП</Name>
		</Properties>
	</Report>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/ИсходящаяКорреспонденция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ИсходящаяКорреспонденция</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыИсходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗакреплен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияРПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонверта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесРПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрикрепленныйФайл</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикрепитьФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодобранныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикрепитьФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВходящаяКорреспонденция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ВходящаяКорреспонденция</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыВходящихПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗакреплен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомерОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящаяДатаОтправителя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассмотрено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПрикрепленныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрикрепленныйФайл</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПрикрепитьФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ОтчетФССП/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьСервер();
КонецПроцедуры

&НаСервере
Процедура СформироватьСервер()
	ОбъектОбработки = РеквизитФормыВЗначение("Отчет");
	Макет = ОбъектОбработки.ПолучитьМакет("Макет");
	ТабДок.Очистить();
	
	//Печать шапки
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Период");
	ТекстПериод = "За период";
	Если ЗначениеЗаполнено(НачалоПериода) Тогда
		ТекстПериод = ТекстПериод + " от " + Формат(НачалоПериода, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	Если ЗначениеЗаполнено(КонецПериода) Тогда
		ТекстПериод = ТекстПериод + " до " + Формат(КонецПериода, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	
	Область.Параметры.Период = ТекстПериод;
	
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка1");
	ТабДок.Вывести(Область);	
	
			
	Область = Макет.ПолучитьОбласть("ДействияПоВозврату");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект КАК Объект,
	                      |	""МероприятияПоДО"" КАК ВидДействия,
	                      |	Мероприятие.Ссылка КАК Действие,
	                      |	Мероприятие.ДатаВыполнения КАК Дата,
	                      |	Мероприятие.Исполнитель КАК Сотрудник
	                      |ПОМЕСТИТЬ ВсеДействия
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ОбъектыВРаботеОстатки.Объект = Мероприятие.Объект
	                      |ГДЕ
	                      |	Мероприятие.Выполнена = ИСТИНА
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.ДатаВыполнения >= &НачалоПериода
	                      |	И Мероприятие.ДатаВыполнения <= &КонецПериода
	                      |	И Мероприятие.ТипМероприятия.ВключатьВОтчетФССП = ИСТИНА
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект,
	                      |	""МероприятияПоДолжникам"",
	                      |	Мероприятие.Ссылка,
	                      |	Мероприятие.ДатаВыполнения,
	                      |	Мероприятие.Исполнитель
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.Мероприятие КАК Мероприятие
	                      |		ПО ОбъектыВРаботеОстатки.Объект.Должник = Мероприятие.Объект
	                      |ГДЕ
	                      |	Мероприятие.Выполнена = ИСТИНА
	                      |	И Мероприятие.ПометкаУдаления = ЛОЖЬ
	                      |	И Мероприятие.ДатаВыполнения >= &НачалоПериода
	                      |	И Мероприятие.ДатаВыполнения <= &КонецПериода
	                      |	И Мероприятие.ТипМероприятия.ВключатьВОтчетФССП = ИСТИНА
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ОбъектыВРаботеОстатки.Объект,
	                      |	""Документы"",
	                      |	ИсходящаяКорреспонденция.Ссылка,
	                      |	ИсходящаяКорреспонденция.ДатаРегистрации,
	                      |	ИсходящаяКорреспонденция.Автор
	                      |ИЗ
	                      |	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИсходящаяКорреспонденция КАК ИсходящаяКорреспонденция
	                      |		ПО ОбъектыВРаботеОстатки.Объект = ИсходящаяКорреспонденция.Объект
	                      |ГДЕ
	                      |	ИсходящаяКорреспонденция.НомерЗакреплен = ИСТИНА
	                      |	И ИсходящаяКорреспонденция.ПометкаУдаления = ЛОЖЬ
	                      |	И ИсходящаяКорреспонденция.ДатаРегистрации >= &НачалоПериода
	                      |	И ИсходящаяКорреспонденция.ДатаРегистрации <= &КонецПериода
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеДействия.Объект.Должник) КАК ЧислоДолжников
	                      |ИЗ
	                      |	ВсеДействия КАК ВсеДействия");
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);	
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Область.Параметры.КолВо1 = Строка(Результат.ЧислоДолжников);
	Иначе
		Область.Параметры.КолВо1 = "0";
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВходящаяКорреспонденция.Объект
	               |ПОМЕСТИТЬ ВсеДокументы
	               |ИЗ
	               |	Справочник.ВходящаяКорреспонденция КАК ВходящаяКорреспонденция
	               |ГДЕ
	               |	ВходящаяКорреспонденция.ТипПисьма = &ЧерезПредставителя
	               |	И ВходящаяКорреспонденция.ПометкаУдаления = ЛОЖЬ
	               |	И ВходящаяКорреспонденция.ДатаРегистрации >= &НачалоПериода
	               |	И ВходящаяКорреспонденция.ДатаРегистрации <= &КонецПериода
	               |	И ВходящаяКорреспонденция.НомерЗакреплен = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ВсеДокументы.Объект) КАК ЧислоЗаявлений
	               |ИЗ
	               |	ВсеДокументы КАК ВсеДокументы";
	Запрос.УстановитьПараметр("ЧерезПредставителя", Справочники.ТипыВходящихПисем.ЗаявлениеОВзаимодействииЧерезПредставителя);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Область.Параметры.КолВо2 = Строка(Результат.ЧислоЗаявлений);
	Иначе
		Область.Параметры.КолВо2 = "0";
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВходящаяКорреспонденция.Объект
	               |ПОМЕСТИТЬ ВсеДокументы
	               |ИЗ
	               |	Справочник.ВходящаяКорреспонденция КАК ВходящаяКорреспонденция
	               |ГДЕ
	               |	ВходящаяКорреспонденция.ТипПисьма = &ОбОтказе
	               |	И ВходящаяКорреспонденция.ПометкаУдаления = ЛОЖЬ
	               |	И ВходящаяКорреспонденция.ДатаРегистрации >= &НачалоПериода
	               |	И ВходящаяКорреспонденция.ДатаРегистрации <= &КонецПериода
	               |	И ВходящаяКорреспонденция.НомерЗакреплен = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ВсеДокументы.Объект) КАК ЧислоЗаявлений
	               |ИЗ
	               |	ВсеДокументы КАК ВсеДокументы";
	Запрос.УстановитьПараметр("ОбОтказе", Справочники.ТипыВходящихПисем.ЗаявлениеОбОтказеОтВзаимодействия);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Область.Параметры.КолВо3 = Строка(Результат.ЧислоЗаявлений);
	Иначе
		Область.Параметры.КолВо3 = "0";
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВходящаяКорреспонденция.Ссылка
	               |ПОМЕСТИТЬ ВсеДокументы
	               |ИЗ
	               |	Справочник.ВходящаяКорреспонденция КАК ВходящаяКорреспонденция
	               |ГДЕ
	               |	(ВходящаяКорреспонденция.ТипПисьма = &Жалоба
	               |			ИЛИ ВходящаяКорреспонденция.ТипПисьма = &Обращение)
	               |	И ВходящаяКорреспонденция.ПометкаУдаления = ЛОЖЬ
	               |	И ВходящаяКорреспонденция.ДатаРегистрации >= &НачалоПериода
	               |	И ВходящаяКорреспонденция.ДатаРегистрации <= &КонецПериода
	               |	И ВходящаяКорреспонденция.НомерЗакреплен = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ВсеДокументы.Ссылка) КАК ЧислоЗаявлений
	               |ИЗ
	               |	ВсеДокументы КАК ВсеДокументы";
	Запрос.УстановитьПараметр("Жалоба", Справочники.ТипыВходящихПисем.ЖалобаФизическогоЛица);
	Запрос.УстановитьПараметр("Обращение", Справочники.ТипыВходящихПисем.ОбращениеФизическогоЛица);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Область.Параметры.КолВо4 = Строка(Результат.ЧислоЗаявлений);
	Иначе
		Область.Параметры.КолВо4 = "0";
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВходящаяКорреспонденция.Ссылка
	               |ПОМЕСТИТЬ ВсеДокументы
	               |ИЗ
	               |	Справочник.ВходящаяКорреспонденция КАК ВходящаяКорреспонденция
	               |ГДЕ
	               |	(ВходящаяКорреспонденция.ТипПисьма = &Жалоба
	               |			ИЛИ ВходящаяКорреспонденция.ТипПисьма = &Обращение)
	               |	И ВходящаяКорреспонденция.ПометкаУдаления = ЛОЖЬ
	               |	И ВходящаяКорреспонденция.ДатаРегистрации >= &НачалоПериода
	               |	И ВходящаяКорреспонденция.ДатаРегистрации <= &КонецПериода
	               |	И ВходящаяКорреспонденция.НомерЗакреплен = ИСТИНА
	               |	И ВходящаяКорреспонденция.Рассмотрено = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ВсеДокументы.Ссылка) КАК ЧислоРассмотренных
	               |ИЗ
	               |	ВсеДокументы КАК ВсеДокументы";
	Запрос.УстановитьПараметр("Жалоба", Справочники.ТипыВходящихПисем.ЖалобаФизическогоЛица);
	Запрос.УстановитьПараметр("Обращение", Справочники.ТипыВходящихПисем.ОбращениеФизическогоЛица);	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Область.Параметры.КолВо5 = Строка(Результат.ЧислоРассмотренных);
	Иначе
		Область.Параметры.КолВо5 = "0";
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВходящаяКорреспонденция.Ссылка,
	               |	ВходящаяКорреспонденция.Объект
	               |ПОМЕСТИТЬ ВсеДокументы
	               |ИЗ
	               |	Справочник.ВходящаяКорреспонденция КАК ВходящаяКорреспонденция
	               |ГДЕ
	               |	(ВходящаяКорреспонденция.ТипПисьма = &Жалоба
	               |			ИЛИ ВходящаяКорреспонденция.ТипПисьма = &Обращение)
	               |	И ВходящаяКорреспонденция.ПометкаУдаления = ЛОЖЬ
	               |	И ВходящаяКорреспонденция.ДатаРегистрации >= &НачалоПериода
	               |	И ВходящаяКорреспонденция.ДатаРегистрации <= &КонецПериода
	               |	И ВходящаяКорреспонденция.НомерЗакреплен = ИСТИНА
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(ВсеДокументы.Ссылка) КАК ЧислоЗаявлений,
	               |	ВсеДокументы.Объект
	               |ПОМЕСТИТЬ ОбъектыИЧисло
	               |ИЗ
	               |	ВсеДокументы КАК ВсеДокументы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВсеДокументы.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ОбъектыИЧисло.ЧислоЗаявлений - 1) КАК ЧислоПовторных
	               |ИЗ
	               |	ОбъектыИЧисло КАК ОбъектыИЧисло
	               |ГДЕ
	               |	ОбъектыИЧисло.ЧислоЗаявлений > 1";
	Запрос.УстановитьПараметр("Жалоба", Справочники.ТипыВходящихПисем.ЖалобаФизическогоЛица);
	Запрос.УстановитьПараметр("Обращение", Справочники.ТипыВходящихПисем.ОбращениеФизическогоЛица);		
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Область.Параметры.КолВо6 = Строка(Результат.ЧислоПовторных);
	Иначе
		Область.Параметры.КолВо6 = "0";
	КонецЕсли;	
	
	ТабДок.Вывести(Область);
КонецПроцедуры
